ROR-Server/app/controllers/cart_items_controller.rb

  def index
    @cart_items = CartItem.where(:user_id=>params[:user_id])
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 1]]