ROR-Server/app/controllers/money_bags_controller.rb

  def create
    @money_bag = MoneyBag.new(money_bag_params)

    if @money_bag.save
---
INSERT INTO "money_bags" ("user_id", "available_credit", "expenses", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["available_credit", 1000], ["expenses", 0], ["created_at", 2017-05-01 16:48:53 UTC], ["updated_at", 2017-05-01 16:48:53 UTC]]