ROR-Server/app/controllers/product_categories_controller.rb

SELECT "product_categories".* FROM "product_categories" WHERE (ancestry is NULL)
---
  def index
    @product_categories = ProductCategory.where("ancestry is NULL")