ROR-Server/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "khavz@gmail.com"], ["LIMIT", 1]]
---
  def getUserByEmail
    @user_info=User.where(:email=>params[:email]).first

INSERT INTO "users" ("email", "encrypted_password", "username", "created_at", "updated_at", "gender", "city", "state", "nationality") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save